harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
#include "cpu.h"
#include "hwbp_core.h"
#include "hwbp_core_regs.h"
#include "hwbp_core_types.h"
#include "hwbp_core_com.h"
#include "hwbp_sync.h"

/************************************************************************/
/* Note                                                                 */
/************************************************************************/
// - The Common Bank uses the timer TCC1.


/************************************************************************/
/* Define current version                                               */
/************************************************************************/
#define VH 1
#define VL 14
/************************************************************************/

/************************************************************************/
/* Define command headers                                               */
/************************************************************************/
#define CMD_READ				0x01
#define CMD_READ_OK			0x01
#define CMD_READ_ERROR		0x09
#define CMD_WRITE				0x02
#define CMD_WRITE_OK			0x02
#define CMD_WRITE_ERROR		0x0A
#define EVENT					0x03

/************************************************************************/
/* Allocate space for Events                                            */
/************************************************************************/
uint8_t reply_buff[MAX_PACKET_SIZE];

/************************************************************************/
/* Declaration of external variables for commands                       */
/************************************************************************/
extern uint8_t com_mode;
extern uint8_t rx_timeout;
extern uint8_t rx_cmd_ready;
extern uint8_t cmd_len_buff1;
extern uint8_t cmd_len_buff2;

bool rx_temp_cmd_ready = false;

extern uint8_t rxbuff_hwbp_uart_buff1[];
extern uint8_t rxbuff_hwbp_uart_buff2[];
extern uint8_t rxbuff_hwbp_uart_temp_buff1[];

#if HWBP_UART_RXBUFSIZ >= 256
	extern uint16_t hwbp_uart_rx_pointer_buff1;
	extern uint16_t hwbp_uart_rx_pointer_buff2;
#else
	extern uint8_t hwbp_uart_rx_pointer_buff1;
	extern uint8_t hwbp_uart_rx_pointer_buff2;
#endif

extern uint8_t rxbuff_hwbp_usb[];
extern uint16_t hwbp_usb_rx_pointer;

/************************************************************************/
/* Declaration of external variables for events                         */
/************************************************************************/
extern uint8_t app_regs_type[];
extern uint16_t app_regs_n_elements[];
extern uint8_t *app_regs_pointer[];

/************************************************************************/
/* Control of send all the register                                     */
/************************************************************************/
static bool sending_registers = false;
static bool sending_com_registers = false;
static uint8_t sending_register_add;
static uint8_t sending_com_register_add;

/************************************************************************/
/* Control of send all the register                                     */
/************************************************************************/
static uint8_t default_device_name[25];
static bool enables_serial_number_update = false;

/************************************************************************/
/* Headers                                                              */
/************************************************************************/
static void parse_and_reply(uint8_t * packet_p, uint16_t len);
static void xmit_error(uint8_t header, uint8_t * packet);
static void xmit(uint8_t add, uint8_t header, bool use_core_timestamp);

/************************************************************************/
/* Common Regs Structure                                                */
/************************************************************************/
struct CommonBank commonbank;

static uint8_t regs_type[] = {
	TYPE_U16,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U32,
	TYPE_U16,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U16,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U8,
	TYPE_U16
};

static uint16_t regs_n_elements[] = {
	1,
	1,
	1,
	1,
	1,
	1,
	1,
	1,
	1,
	1,
	1,
	1,
	25,
	1,
	1,
	1,
	16,
	8,
	1
};

static uint8_t *regs_pointer[] = {
	(uint8_t*)(&commonbank.R_WHO_AM_I),
	(uint8_t*)(&commonbank.R_HW_VERSION_H),
	(uint8_t*)(&commonbank.R_HW_VERSION_L),
	(uint8_t*)(&commonbank.R_ASSEMBLY_VERSION),
	(uint8_t*)(&commonbank.R_CORE_VERSION_H),
	(uint8_t*)(&commonbank.R_CORE_VERSION_L),
	(uint8_t*)(&commonbank.R_FW_VERSION_H),
	(uint8_t*)(&commonbank.R_FW_VERSION_L),
	(uint8_t*)(&commonbank.R_TIMESTAMP_SECOND),
	(uint8_t*)(&commonbank.R_TIMESTAMP_MICRO),
	(uint8_t*)(&commonbank.R_OPERATION_CTRL),
	(uint8_t*)(&commonbank.R_RESET_DEV),
	(uint8_t*)(commonbank.R_DEVICE_NAME),
	(uint8_t*)(&commonbank.R_SERIAL_NUMBER),
	(uint8_t*)(&commonbank.R_CLOCK_CONFIG),
	(uint8_t*)(&commonbank.R_TIMESTAMP_OFFSET),
	(uint8_t*)(commonbank.R_UID),
	(uint8_t*)(commonbank.R_TAG),
	(uint8_t*)(&commonbank.R_HEARTBEAT)
};



/************************************************************************/
/* Variables and definitions                                            */
/************************************************************************/
static uint16_t core_app_mem_size_to_save;
static uint8_t * core_pointer_to_app_regs;
static uint8_t core_num_of_app_registers;

#if defined(__AVR_ATxmega16A4U__)
    #define SET_STATE_LED PORTD_OUTSET = (1<<5)
    #define CLR_STATE_LED PORTD_OUTCLR = (1<<5)
    #define TGL_STATE_LED PORTD_OUTTGL = (1<<5)
    #define CONFIG_STATE_LED io_pin2out(&PORTD, 5, OUT_IO_DIGITAL, IN_EN_IO_DIS);
#endif
#if defined(__AVR_ATxmega32A4U__)
	#define SET_STATE_LED PORTR_OUTSET = (1<<0)
	#define CLR_STATE_LED PORTR_OUTCLR = (1<<0)
	#define TGL_STATE_LED PORTR_OUTTGL = (1<<0)
	#define CONFIG_STATE_LED io_pin2out(&PORTR, 0, OUT_IO_DIGITAL, IN_EN_IO_DIS);
#endif
#if defined(__AVR_ATxmega64A4U__)
	#define SET_STATE_LED PORTD_OUTSET = (1<<5)
	#define CLR_STATE_LED PORTD_OUTCLR = (1<<5)
	#define TGL_STATE_LED PORTD_OUTTGL = (1<<5)
	#define CONFIG_STATE_LED io_pin2out(&PORTD, 5, OUT_IO_DIGITAL, IN_EN_IO_DIS);
#endif
#if defined(__AVR_ATxmega128A4U__)
	#define SET_STATE_LED PORTR_OUTSET = (1<<0)
	#define CLR_STATE_LED PORTR_OUTCLR = (1<<0)
	#define TGL_STATE_LED PORTR_OUTTGL = (1<<0)
	#define CONFIG_STATE_LED io_pin2out(&PORTR, 0, OUT_IO_DIGITAL, IN_EN_IO_DIS);
#endif
#if defined(__AVR_ATxmega128A1U__)
	#define SET_STATE_LED PORTA_OUTSET = (1<<6)
	#define CLR_STATE_LED PORTA_OUTCLR = (1<<6)
	#define TGL_STATE_LED PORTA_OUTTGL = (1<<6)
	#define CONFIG_STATE_LED io_pin2out(&PORTA, 6, OUT_IO_DIGITAL, IN_EN_IO_DIS);
#endif

