harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
/************************************************************************/
/* Initialize Common Bank and used peripherals                          */
/************************************************************************/
#define F_CPU 32000000
static uint8_t _500us_cca_values[] = {15, 16, 16, 15, 16, 15, 16, 16};
static uint8_t _500us_cca_index = 0;

#define EEPROM_ADD_MEM_IN_USE       0
#define EEPROM_ADD_R_OPERATION_CTRL 1
#define EEPROM_ADD_R_FW_VERSION_H   2
#define EEPROM_ADD_R_CORE_VERSION_H 3
#define EEPROM_ADD_SN_HIGH          4
#define EEPROM_ADD_SN_LOW           5
#define EEPROM_ADD_CLOCK_CONFIG     6
#define EEPROM_ADD_R_DEVICE_NAME    7
#define EEPROM_ADD_APP_REG          32

#define R_DEVICE_NAME_SIZE          25

#define EEPROM_RST_USE_REGS_DEF     0xDF
#define EEPROM_RST_USE_REGS_EE      0xEE

static void write_device_name_to_eeprom(const uint8_t *dev_name)
{
    bool end_of_line_detected = false;
        
    for (uint8_t i = 0; i < R_DEVICE_NAME_SIZE; i++)
    {
        /* Check if there is an end of line */
        if (dev_name[i] == 0)
        {
            end_of_line_detected = true;
        }
            
        if (end_of_line_detected)
        {
            /* If end of line was detected, the rest of the register will be zeros */
            eeprom_wr_byte(EEPROM_ADD_R_DEVICE_NAME + i, 0);
        }
        else
        {
            eeprom_wr_byte(EEPROM_ADD_R_DEVICE_NAME + i, dev_name[i]);
        }
    }        
}

static void read_device_name_to_register(void)
{
    for (uint8_t i = 0; i < R_DEVICE_NAME_SIZE; i++)
    {
        commonbank.R_DEVICE_NAME[i] = eeprom_rd_byte(EEPROM_ADD_R_DEVICE_NAME + i);
    }
}

void core_func_start_core (
    const uint16_t who_am_i,
    const uint8_t hwH,
    const uint8_t hwL,
    const uint8_t fwH,
    const uint8_t fwL,
    const uint8_t assembly,
    uint8_t *pointer_to_app_regs,
    const uint16_t app_mem_size_to_save,
    const uint8_t num_of_app_registers,
    const uint8_t *device_name,
    const bool	device_is_able_to_repeat_clock,
    const bool	device_is_able_to_generate_clock,
	 const uint8_t default_timestamp_offset)
{	
	/* Shut down watchdog */
	wdt_disable();
	
	/* Start external clock */
	cpu_config_clock(F_CPU, true, true);
	
	/* Configure sleep mode */
	SLEEP_CTRL = SLEEP_SMODE_IDLE_gc | SLEEP_SEN_bm;
	
	/* Initialize common register bank */
	commonbank.R_WHO_AM_I = who_am_i;	
	commonbank.R_HW_VERSION_H = hwH;
	commonbank.R_HW_VERSION_L = hwL;
	commonbank.R_ASSEMBLY_VERSION = assembly;
	commonbank.R_CORE_VERSION_H = VH;
	commonbank.R_CORE_VERSION_L = VL;
	commonbank.R_FW_VERSION_H = fwH;
	commonbank.R_FW_VERSION_L = fwL;
	commonbank.R_TIMESTAMP_SECOND = 0;		// Timestamps starts from 0 (ZERO)
	commonbank.R_TIMESTAMP_MICRO = 0;		// Timestamps starts from 0 (ZERO)
	commonbank.R_HEARTBEAT = 0;
	//commonbank.R_RESET_DEV = 0;
	
	/* Reset UID to zero */
	for (uint8_t i = 0; i < regs_n_elements[ADD_R_UID]; i++)
		commonbank.R_UID[i] = 0;
	
	/* Reset Tag to zero */
	for (uint8_t i = 0; i < regs_n_elements[ADD_R_TAG]; i++)
		commonbank.R_TAG[i] = 0;
        
    /* Read versions from EEPROM */
    uint8_t previousFwH   = eeprom_rd_byte(EEPROM_ADD_R_FW_VERSION_H);
    uint8_t previousHarpH = eeprom_rd_byte(EEPROM_ADD_R_CORE_VERSION_H);
    
    /* Check if the versions on EEPROM were never updated */
    if (previousHarpH == 0xFF)
    {
        eeprom_wr_byte(EEPROM_ADD_R_FW_VERSION_H, fwH);
        eeprom_wr_byte(EEPROM_ADD_R_CORE_VERSION_H, VH);
        
        previousFwH   = eeprom_rd_byte(EEPROM_ADD_R_FW_VERSION_H);
        previousHarpH = eeprom_rd_byte(EEPROM_ADD_R_CORE_VERSION_H);
        
        /* Write the device name for the first time */
        write_device_name_to_eeprom(device_name);        
		
        /* Force device to start with default values */
        eeprom_wr_byte(EEPROM_ADD_MEM_IN_USE, EEPROM_RST_USE_REGS_DEF);
    }
    
    /* Check if the device was updated to a higher major version */
    //if ((fwH != previousFwH) || ((VH != previousHarpH))
    if ((fwH != previousFwH) || (VH != previousHarpH))   // Don't need to reset registers on this major version (VH = 1)
    {
        /* Force device to start with default values */
        eeprom_wr_byte(EEPROM_ADD_MEM_IN_USE, EEPROM_RST_USE_REGS_DEF);
        
        /* Update EERPOM */
        eeprom_wr_byte(EEPROM_ADD_R_FW_VERSION_H, fwH);
        eeprom_wr_byte(EEPROM_ADD_R_CORE_VERSION_H, VH);
    }        
	
	/* Callback to start the device */
	core_callback_initialize_hardware();

	/* Check if the EEPROM should be used as registers' content */
	if (eeprom_rd_byte(EEPROM_ADD_MEM_IN_USE) == EEPROM_RST_USE_REGS_EE)
	{
		commonbank.R_OPERATION_CTRL = eeprom_rd_byte(EEPROM_ADD_R_OPERATION_CTRL);

		for (uint16_t i = 0; i < app_mem_size_to_save; i++)
			*(pointer_to_app_regs + i) = eeprom_rd_byte(EEPROM_ADD_APP_REG + i);
		
		commonbank.R_CLOCK_CONFIG = eeprom_rd_byte(EEPROM_ADD_CLOCK_CONFIG);
		commonbank.R_CLOCK_CONFIG &=  ~B_CLK_LOCK;		// Always remove LOCK after boot
		commonbank.R_CLOCK_CONFIG |=   B_CLK_UNLOCK;
		
		/* Check if CONFIG register was never used before */
		/* Since it's a new register, previous devices don't have any data */
		if (commonbank.R_CLOCK_CONFIG == 0xFF)
		{
			commonbank.R_CLOCK_CONFIG = B_CLK_UNLOCK;
			core_callback_clock_to_unlock();
			
			commonbank.R_CLOCK_CONFIG |= (device_is_able_to_repeat_clock)   ? B_CLK_REP : 0;
			commonbank.R_CLOCK_CONFIG |= (device_is_able_to_generate_clock) ? B_CLK_GEN : 0;
			core_callback_define_clock_default();
		}
		else
		{
			/* Configure hardware according to clock configuration */
			/* Use core_func_start_core's input in case there was an hardware change */
			if (device_is_able_to_repeat_clock   && (commonbank.R_CLOCK_CONFIG & B_CLK_REP)) {core_callback_clock_to_repeater();  commonbank.R_HEARTBEAT &= ~B_IS_SYNCHRONIZED;}
			if (device_is_able_to_generate_clock && (commonbank.R_CLOCK_CONFIG & B_CLK_GEN)) {core_callback_clock_to_generator(); commonbank.R_HEARTBEAT |=  B_IS_SYNCHRONIZED;}
			if (commonbank.R_CLOCK_CONFIG & B_CLK_LOCK)   core_callback_clock_to_lock();
			if (commonbank.R_CLOCK_CONFIG & B_CLK_UNLOCK) core_callback_clock_to_unlock();
		}
		
