harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
		commonbank.R_RESET_DEV = B_BOOT_EE;
		core_callback_registers_were_reinitialized();
	}
	else
	{
		commonbank.R_OPERATION_CTRL = B_OPLEDEN | B_VISUALEN | GM_OP_MODE_STANDBY;		
		commonbank.R_HEARTBEAT &= ~B_IS_ACTIVE;
		
		commonbank.R_CLOCK_CONFIG = B_CLK_UNLOCK;
		core_callback_clock_to_unlock();
		
		commonbank.R_CLOCK_CONFIG |= (device_is_able_to_repeat_clock)   ? B_REP_ABLE : 0;
		commonbank.R_CLOCK_CONFIG |= (device_is_able_to_generate_clock) ? B_GEN_ABLE : 0;
		core_callback_define_clock_default();
		
		commonbank.R_RESET_DEV = B_BOOT_DEF;
		
		core_callback_reset_registers();
		core_callback_registers_were_reinitialized();
	}
	core_app_mem_size_to_save = app_mem_size_to_save;
	core_pointer_to_app_regs = pointer_to_app_regs;
	core_num_of_app_registers = num_of_app_registers;
    
    /* Check if the device's name was never updated before */
    if (eeprom_rd_byte(EEPROM_ADD_R_DEVICE_NAME) == 0xFF)
    {
        write_device_name_to_eeprom(device_name);
    }
    
    /* Update device's name register */
    read_device_name_to_register();
    
    /* Get device name for further updates */
    for (uint8_t i = 0; i < R_DEVICE_NAME_SIZE; i++)
    {
        *(default_device_name + i) = commonbank.R_DEVICE_NAME[i];
    }
	
	/* Get serial number */
	commonbank.R_SERIAL_NUMBER = eeprom_rd_byte(EEPROM_ADD_SN_HIGH);
	commonbank.R_SERIAL_NUMBER = ((commonbank.R_SERIAL_NUMBER << 8) & 0xFF00) | eeprom_rd_byte(EEPROM_ADD_SN_LOW);
	
	/* Check if the device has hardware and is able to repeat the timestamp clock */
	/* Needs to be checked because the EEPROM content may note refelect reality due to hardware improvements */
	if (device_is_able_to_repeat_clock)
		commonbank.R_CLOCK_CONFIG |= B_REP_ABLE;
	else
		commonbank.R_CLOCK_CONFIG &= ~B_REP_ABLE;
	
	/* Check if the device has hardware and is able to provide the timestamp clock */
	/* Needs to be checked because the EEPROM content may note reflect reality due to hardware improvements */
	if (device_is_able_to_generate_clock)
		commonbank.R_CLOCK_CONFIG |= B_GEN_ABLE;
	else
		commonbank.R_CLOCK_CONFIG &= ~B_GEN_ABLE;
	
	/* Configures default shift when programing the timestamp */
	commonbank.R_TIMESTAMP_OFFSET = default_timestamp_offset;
	
	/* Start 1 second timer */
	timer_type1_enable(&TCC1, TIMER_PRESCALER_DIV1024, 31250, INT_LEVEL_LOW);

	/* Re-start 500 us timer */
	TCC1_CCA = _500us_cca_values[_500us_cca_index++] - 1;
	TCC1_INTCTRLB = INT_LEVEL_LOW;

	/* Configure PORT to drive the op LED */
	CONFIG_STATE_LED;
	SET_STATE_LED;

	/* Configure main UART with 1 Mbit/s */
	hwbp_com_uart_init(1, 0, false);
	hwbp_com_uart_enable();
    
    /* Configure timestamp UART */    
    initialize_timestamp_uart(&commonbank.R_TIMESTAMP_SECOND);
}

void core_func_catastrophic_error_detected(void)
{
	core_callback_catastrophic_error_detected();

	while(1)
	{
		for (uint32_t i = 0; i < F_CPU/100; i++)
			;

		TGL_STATE_LED;
	}
}

/************************************************************************/
/* One second timer                                                     */
/* Run time:                                                            */
/*           4.12 us when heartbeat is disabled                         */
/*           29.6 us when heartbeat is enabled                          */
/************************************************************************/
static uint8_t shutdown_counter = 0;

extern uint8_t device_lost_sync_counter;

ISR(TCC1_OVF_vect, ISR_NAKED)
{
	commonbank.R_TIMESTAMP_SECOND++;
   
    RESET_TIMESTAMP_COUNTER;
    INCREASE_LOST_SYNC_COUNTER;

	/* Re-start 500 us timer */	
	TCC1_CCA = _500us_cca_values[0] - 1;
	_500us_cca_index = 1;
 	
    core_callback_t_before_exec();    
	
	TCC1_INTFLAGS |= TC1_CCAIF_bm;
	
	core_callback_t_new_second();
	core_callback_t_1ms();	
	
	if ((commonbank.R_OPERATION_CTRL & B_ALIVE_EN) && ((commonbank.R_OPERATION_CTRL & B_HEARTBEAT_EN) == 0))
		core_func_send_event(ADD_R_TIMESTAMP_SECOND, true);
	if (commonbank.R_OPERATION_CTRL & B_HEARTBEAT_EN)
		core_func_send_event(ADD_R_HEARTBEAT, true);
	
	uint8_t op_led_comp;
	switch (commonbank.R_OPERATION_CTRL & MSK_OP_MODE)
	{
		case GM_OP_MODE_STANDBY:
			op_led_comp = 4;
			break;

		case GM_OP_MODE_ACTIVE:
			op_led_comp = 2;
			break;

		default:	op_led_comp = 1;
	};
		
	if (*((uint8_t*)(&commonbank.R_TIMESTAMP_SECOND)) & op_led_comp)
	{
		CLR_STATE_LED;
	}
	else
	{
		if (commonbank.R_OPERATION_CTRL & B_OPLEDEN)
		{
			SET_STATE_LED;
		}
	}

	core_callback_t_after_exec();

	if (TCC1_INTFLAGS & TC1_CCAIF_bm)
		if (shutdown_counter == 0)
			core_func_catastrophic_error_detected();

	reti();
}


/************************************************************************/
/* 500 us timer used to call app                                        */
/* Run time:                                                            */
/*           4.76 us                                                    */
/************************************************************************/
uint16_t CTS_timeout_counter = 0;
#define CTS_TIMEOUT_MS 3000

#if HWBP_UART_TXBUFSIZ > 256
    extern uint16_t hwbp_uart_tail;
    extern uint16_t hwbp_uart_head;
#else
    extern uint8_t hwbp_uart_tail;
    extern uint8_t hwbp_uart_head;
#endif

ISR(TCC1_CCA_vect, ISR_NAKED)
{   
	SYNC_TRIGGER_TIMER;
    
    TCC1_CCA += _500us_cca_values[_500us_cca_index++ & 0x07];
	
    core_callback_t_before_exec();
	

	//core_send_event(ADD_R_TIMESTAMP_SECOND);

	if ((_500us_cca_index & 1) == 0)
	{
		/* Make sure that any UART or USB interrupts will not
		update rx buffers */
		if (com_mode == COM_MODE_UART)
		{
			/* Disable rx external hardware */
			disable_hwbp_uart_rx;

// 			/* Disable high level interrupts */
// 			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
// 			
// 			/* Disable USART RX */
// 			HWBP_UART_UART.CTRLA &= ~(USART_RXCINTLVL_gm);
// 
// 			/* Re-enable high level interrupts */
// 			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
		}
		
		/* Check timeout and, if happens, reset pointers  */
		if (rx_timeout > 0)
		{
			if (--rx_timeout == 0)
			{
				rx_timeout = 0;
				rx_cmd_ready = 0;

				hwbp_uart_rx_pointer_buff1 = 0;
				hwbp_uart_rx_pointer_buff2 = 0;
				//hwbp_usb_rx_pointer = 0;
			}
		}		

