harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
		/* Check if a command exist in the temporary buffer */
		if (rxbuff_hwbp_uart_temp_buff1[0] != 0)
		{
			if (*((uint32_t*)(rxbuff_hwbp_uart_temp_buff1+5)) < commonbank.R_TIMESTAMP_SECOND)			// if timestamp < device's timestamp
			{
				rx_temp_cmd_ready = true;
			}
			else if (*((uint32_t*)(rxbuff_hwbp_uart_temp_buff1+5)) == commonbank.R_TIMESTAMP_SECOND)	// if timestamp = device's timestamp
			{
				if (*((uint16_t*)(rxbuff_hwbp_uart_temp_buff1+5+4)) <= TCC1_CNT)						// if us <= device's us
				{
					rx_temp_cmd_ready = true;
				}
			}
		}
		
		/* Disable high level interrupts */
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
		
		if (rx_temp_cmd_ready)
		{
			/* Re-enable high level interrupts */
			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;			
			
			parse_and_reply(rxbuff_hwbp_uart_temp_buff1, rxbuff_hwbp_uart_temp_buff1[1]);
			
			rxbuff_hwbp_uart_temp_buff1[0] = 0;	// Clear temporary message
			rx_temp_cmd_ready = false;
		}
		else if (rx_cmd_ready)
		{
			if (rx_cmd_ready == 1)
			{
				/* Re-enable high level interrupts */
				PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
				PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
				
				uint8_t * type = (*(rxbuff_hwbp_uart_buff1+1) != 255) ? (rxbuff_hwbp_uart_buff1+4) : (rxbuff_hwbp_uart_buff1+6);
				
				if (*type & 16)
				{
					/* If it's timestamped */
					if (*((uint32_t*)(type+1)) < commonbank.R_TIMESTAMP_SECOND)			// if timestamp < device's timestamp
					{
						parse_and_reply(rxbuff_hwbp_uart_buff1, cmd_len_buff1);
						TGL_STATE_LED;
					}
					else if (*((uint32_t*)(type+1)) == commonbank.R_TIMESTAMP_SECOND)	// if timestamp = device's timestamp
					{
						if (*((uint16_t*)(type+1+4)) <= TCC1_CNT)						// if us <= device's us
						{
							parse_and_reply(rxbuff_hwbp_uart_buff1, cmd_len_buff1);
							TGL_STATE_LED;
						}
					}
					else
					{
						/* Copy to temporary buffer*/
						memcpy(rxbuff_hwbp_uart_temp_buff1, rxbuff_hwbp_uart_buff1, rxbuff_hwbp_uart_buff1[1] + 2);
					}
				}
				else
				{
					parse_and_reply(rxbuff_hwbp_uart_buff1, cmd_len_buff1);
				}
			}
			else
			{
				/* Re-enable high level interrupts */
				PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
				PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
				
				uint8_t * type = (*(rxbuff_hwbp_uart_buff2+1) != 255) ? (rxbuff_hwbp_uart_buff2+4) : (rxbuff_hwbp_uart_buff2+6);
				
				if (*type & 16)
				{
					/* If it's timestamped */
					if (*((uint32_t*)(type+1)) < commonbank.R_TIMESTAMP_SECOND)			// if timestamp < device's timestamp
					{
						parse_and_reply(rxbuff_hwbp_uart_buff2, cmd_len_buff2);
						TGL_STATE_LED;
					}
					else if (*((uint32_t*)(type+1)) == commonbank.R_TIMESTAMP_SECOND)	// if timestamp = device's timestamp
					{
						if (*((uint16_t*)(type+1+4)) <= TCC1_CNT)						// if us <= device's us
						{
							parse_and_reply(rxbuff_hwbp_uart_buff2, cmd_len_buff2);
							TGL_STATE_LED;
						}
					}
					else
					{	
						/* Copy to temporary buffer*/
						memcpy(rxbuff_hwbp_uart_temp_buff1, rxbuff_hwbp_uart_buff2, rxbuff_hwbp_uart_buff2[1] + 2);
					}
				}
				else
				{
					parse_and_reply(rxbuff_hwbp_uart_buff2, cmd_len_buff2);
				}
			}
			
			/* Disable high level interrupts */
			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
		
			rx_cmd_ready = 0;
		}
		
		/* Re-enable high level interrupts */
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
        
        
        if (com_mode == COM_MODE_UART)
        {
            /* If CTS not ok, destroy data and go to Standby if in Active Mode */
            if (read_io(HWBP_UART_CTS_PORT, HWBP_UART_CTS_pin))
            {
                if (++CTS_timeout_counter == CTS_TIMEOUT_MS)
                {
                    CTS_timeout_counter = 0;
                    
                    if ((commonbank.R_OPERATION_CTRL & MSK_OP_MODE) == GM_OP_MODE_ACTIVE )
                    {
                        /* Return to Standby Mode */
                        uint8_t aux_op_ctrl = commonbank.R_OPERATION_CTRL;
                        
                        aux_op_ctrl &= ~MSK_OP_MODE;
                        aux_op_ctrl |= GM_OP_MODE_STANDBY;
                        hwbp_write_common_reg(ADD_R_OPERATION_CTRL, TYPE_U8, &aux_op_ctrl, 1);
                        commonbank.R_HEARTBEAT &= ~B_IS_ACTIVE;
                    }
                    
                    /* Destroy all data on the buffers */
                    hwbp_uart_tail = 0;
                    hwbp_uart_head = 0;
                
                    /* Disable uart DRE interrupt until RTS is logic low */
                    HWBP_UART_UART.CTRLA &= ~(USART_DREINTLVL_OFF_gc | USART_DREINTLVL_gm);
                }                
            }
            else
            {
                CTS_timeout_counter = 0;
            }
        }            
		
		if (com_mode == COM_MODE_UART)
		{
// 			/* Disable high level interrupts */
// 			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
// 
// 			/* Enable USART RX */
// 			HWBP_UART_UART.CTRLA |= (HWBP_UART_RX_INT_LEVEL<< 4);
// 
// 			/* Re-enable high level interrupts */
// 			PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;

			/* Enable rx external hardware */
			enable_hwbp_uart_rx;
		}

		core_callback_t_500us();
	}
	else
	{
		core_callback_t_1ms();
	}

	if (shutdown_counter > 0)
		if (--shutdown_counter == 0)			
			wdt_reset_device();

	/* Send common registers */
	if (sending_com_registers)
	{	
		/* Each 2 milliseconds */
		if ((_500us_cca_index & 0x03) == 2)
		{
			if (hwbp_read_common_reg(sending_com_register_add, regs_type[sending_com_register_add]))
				xmit(sending_com_register_add, CMD_READ_OK, true);

