harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
			if (++sending_com_register_add == COMMON_BANK_ABSOLUTE_ADD_MAX )
				sending_com_registers = false;
		}
	}

	/* Send app registers */
	if (sending_registers)
	{
		/* Each 2 milliseconds */
		if ((_500us_cca_index & 0x03) == 0)
		{
			if (core_read_app_register(sending_register_add + 0x20, app_regs_type[sending_register_add]))
				xmit(sending_register_add + 0x20, CMD_READ_OK, true);

			if (++sending_register_add == core_num_of_app_registers )
				sending_registers = false;
		}
	}

	core_callback_t_after_exec();

	if (TCC1_INTFLAGS & TC1_CCAIF_bm)
		if (shutdown_counter == 0)
			core_func_catastrophic_error_detected();

	reti();
}


/************************************************************************/
/* Parse received command                                               */
/************************************************************************/
#define check_checksum(array, leng, checksum_) checksum_ = 0; for (uint8_t iii = 0; iii < leng; iii++) checksum_ += array[iii];

static void parse_and_reply(uint8_t * packet_p, uint16_t len)
{
	uint8_t add = (*(packet_p+1) != 255) ? *(packet_p+2) : *(packet_p+4);			// add
	uint8_t port = (*(packet_p+1) != 255) ? *(packet_p+3) : *(packet_p+5);			// port
	uint8_t type = (*(packet_p+1) != 255) ? *(packet_p+4) : *(packet_p+6);			// type
	uint8_t * payload_p;																				// payload pointer
	uint16_t payload_n_elements;																	// number of elements on the payload array
	
	/* Update payload address, type, and payload_n_elements */
	if (type & 16)
	{
		/* If it's timestamped */
		type &= 0xEF;//~(16);																		// clear timestamp flag
		payload_p = (*(packet_p+1) != 255) ? (packet_p+5+6) : (packet_p+7+6);		// payload pointer
		payload_n_elements = (len - 4-6) / (type & MSK_TYPE_LEN);						// number of elements on the payload array
	}
	else
	{
		/* if it's _not_ timestamped */
		payload_p = (*(packet_p+1) != 255) ? (packet_p+5) : (packet_p+7);				// payload pointer
		payload_n_elements = (len - 4) / (type & MSK_TYPE_LEN);							// number of elements on the payload array
	}
	
	bool ok = false;
	
	/* Check checksum */
	uint8_t checksum;
	check_checksum(packet_p, len+1, checksum);
	if (packet_p[len+1] != checksum)
		return;

	/* Check port */
	if (port == 0xFF)	// This device
	{
		/* Read registers */
		if (*packet_p == CMD_READ)
		{
			if (add <= COMMON_BANK_ABSOLUTE_ADD_MAX)
            {
				ok = hwbp_read_common_reg(add, type);
            }                
			else
            {
				ok = core_read_app_register(add, type);
            }                
            
            if (!(commonbank.R_OPERATION_CTRL & B_MUTE_RPL))
            {
			    if (ok)
                {
				    xmit(add, CMD_READ_OK, true);
                }                    
			    else
                {
				    xmit_error(CMD_READ_ERROR, packet_p);
                }                    
            }                    
		}

		/* Write registers */
		else
		{
			if (add <= COMMON_BANK_ABSOLUTE_ADD_MAX)
            {
				ok = hwbp_write_common_reg(add, type, payload_p, payload_n_elements);
            }                
			else
            {
				ok = core_write_app_register(add, type, payload_p, payload_n_elements);
            }                
			
            if (!(commonbank.R_OPERATION_CTRL & B_MUTE_RPL))
            {
			    if (ok)
                {
				    xmit(add, CMD_WRITE_OK, true);
                }                    
			    else
                {
				    xmit_error(CMD_WRITE_ERROR, packet_p);
                }                    
            }                    
		}
	}
}

/************************************************************************/
/* Send event                                                           */
/************************************************************************/
static uint8_t * reg_p;

extern bool clock_was_just_updated_externaly;

static void xmit_error(uint8_t header, uint8_t * packet)
{		
	clock_was_just_updated_externaly = false;
	
	/* Check if packet is above limits */
	if ( (packet[1] + 2 + 6) > (MAX_PACKET_SIZE - 1) )
		return;
	
	/* Shift payload by 6 positions */
	for (uint8_t i = 0; i < packet[1] - 3; i++)
		packet[11 + i] = packet[5 + i];
	
	/* Update values */
	packet[0] = header;
	packet[1] += 6;													// update len
	packet[4] |= MSK_TIMESTAMP_AT_PAYLOAD;							// update type

	/* Update second */
	if (TCC1_INTFLAGS & TC1_OVFIF_bm)
	{
		/* Add 1 if the new second interrupt FLAG is already set */
		*((uint32_t*)(packet+5)) = commonbank.R_TIMESTAMP_SECOND+1;	// update second
        *((uint16_t*)(packet+9)) = TCC1_CNT;				        // update microsecond
	}
	else
	{
		*((uint32_t*)(packet+5)) = commonbank.R_TIMESTAMP_SECOND;	// update second
        *((uint16_t*)(packet+9)) = TCC1_CNT;						// update microsecond
        
        if (_500us_cca_index == 208)
        {
            /* It may be on the last timer iteration */
            
            if (*((uint16_t*)(packet+9)) < _500us_cca_values[0])
            {
                /* This is not possible unless the timer overflow happened on this instant */
                
                *((uint32_t*)(packet+5)) = commonbank.R_TIMESTAMP_SECOND+1; // update second
            }
        }            
	}
	
	if (clock_was_just_updated_externaly)
	{
		/* Update second */
		if (TCC1_INTFLAGS & TC1_OVFIF_bm)
		{
			/* Add 1 if the new second interrupt FLAG is already set */
			*((uint32_t*)(packet+5)) = commonbank.R_TIMESTAMP_SECOND+1;	// update second
			*((uint16_t*)(packet+9)) = TCC1_CNT;				        // update microsecond
		}
		else
		{
			*((uint32_t*)(packet+5)) = commonbank.R_TIMESTAMP_SECOND;	// update second
			*((uint16_t*)(packet+9)) = TCC1_CNT;						// update microsecond
			
			if (_500us_cca_index == 208)
			{
				/* It may be on the last timer iteration */
				
				if (*((uint16_t*)(packet+9)) < _500us_cca_values[0])
				{
					/* This is not possible unless the timer overflow happened on this instant */
					
					*((uint32_t*)(packet+5)) = commonbank.R_TIMESTAMP_SECOND+1; // update second
				}
			}
		}
	}
	
	check_checksum(packet, packet[1] + 1, packet[packet[1] + 1]);	// update checksum

	/* Send Error */
	if (com_mode == COM_MODE_UART)
	{
		/* Disable TX interrupts before update tx buffers */
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;			
		
		/* Disable USART TX */
		uint8_t TxInterruptState = HWBP_UART_UART.CTRLA & USART_DREINTLVL_gm;
		HWBP_UART_UART.CTRLA &= ~(USART_DREINTLVL_gm);

		/* Xmit trough USART */
		hwbp_uart_xmit(packet, packet[1] + 2);

		/* Recover USART TX Interrupt state */
		HWBP_UART_UART.CTRLA |= TxInterruptState;

		/* Re-enable high level interrupts */
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;
	}
	else
	{

