harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
	}
}

static uint32_t user_R_TIMESTAMP_SECOND = 0;
static uint16_t user_TCC1_CNT = 0;

void core_func_update_user_timestamp(uint32_t seconds, uint16_t useconds)
{
	user_R_TIMESTAMP_SECOND = seconds;
	user_TCC1_CNT = useconds;
}

void core_func_read_user_timestamp(uint32_t *seconds, uint16_t *useconds)
{
    *seconds = user_R_TIMESTAMP_SECOND;
    *useconds = user_TCC1_CNT;
}

void core_func_mark_user_timestamp(void)
{
	clock_was_just_updated_externaly = false;
	
    if (TCC1_INTFLAGS & TC1_OVFIF_bm)
    {
        /* Add 1 if the new second interrupt FLAG is already set */
        user_R_TIMESTAMP_SECOND = commonbank.R_TIMESTAMP_SECOND+1;
        user_TCC1_CNT = TCC1_CNT;
    }
    else
    {
        user_R_TIMESTAMP_SECOND = commonbank.R_TIMESTAMP_SECOND;
        user_TCC1_CNT = TCC1_CNT;
        	
        if (_500us_cca_index == 208)
        {
            /* It may be on the last timer iteration */
            	
            if (user_TCC1_CNT < _500us_cca_values[0])
            {
                /* This is not possible unless the timer overflow happened on this instant */
                	
                user_R_TIMESTAMP_SECOND = commonbank.R_TIMESTAMP_SECOND+1; // update second
            }
        }
    }
	
	if (clock_was_just_updated_externaly)
	{
		if (TCC1_INTFLAGS & TC1_OVFIF_bm)
		{
			/* Add 1 if the new second interrupt FLAG is already set */
			user_R_TIMESTAMP_SECOND = commonbank.R_TIMESTAMP_SECOND+1;
			user_TCC1_CNT = TCC1_CNT;
		}
		else
		{
			user_R_TIMESTAMP_SECOND = commonbank.R_TIMESTAMP_SECOND;
			user_TCC1_CNT = TCC1_CNT;
			
			if (_500us_cca_index == 208)
			{
				/* It may be on the last timer iteration */
				
				if (user_TCC1_CNT < _500us_cca_values[0])
				{
					/* This is not possible unless the timer overflow happened on this instant */
					
					user_R_TIMESTAMP_SECOND = commonbank.R_TIMESTAMP_SECOND+1; // update second
				}
			}
		}
	}
}

static void xmit(uint8_t add, uint8_t header, bool use_core_timestamp)
{
	clock_was_just_updated_externaly = false;
	
	uint8_t type;
	uint16_t n_elements;

	/* Get type and number of elements */
	if (add >= 0x20)
	{
		type = app_regs_type[add-0x20];
		n_elements = app_regs_n_elements[add-0x20];
		reg_p = app_regs_pointer[add-0x20];
	}
	else if (add <= COMMON_BANK_ADD_MAX)
	{
		type = regs_type[add];
		n_elements = regs_n_elements[add];
		reg_p = regs_pointer[add];
	}
	else
		return;
	
	/* Update Event's temporary buffer */
	reply_buff[0] = header;	
	reply_buff[1] = (type & MSK_TYPE_LEN) * (n_elements) + 10;			    // update len
	reply_buff[2] = add;													// update add
	reply_buff[3] = 255;													// update port	
	reply_buff[4] = type | MSK_TIMESTAMP_AT_PAYLOAD;						// update type
	
	if (use_core_timestamp)
	{
	    if (TCC1_INTFLAGS & TC1_OVFIF_bm)
	    {
    	    /* Add 1 if the new second interrupt FLAG is already set */
    	    *((uint32_t*)(reply_buff+5)) = commonbank.R_TIMESTAMP_SECOND+1;	// update second
    	    *((uint16_t*)(reply_buff+9)) = TCC1_CNT;				        // update microsecond
	    }
	    else
	    {
    	    *((uint32_t*)(reply_buff+5)) = commonbank.R_TIMESTAMP_SECOND;	// update second
    	    *((uint16_t*)(reply_buff+9)) = TCC1_CNT;						// update microsecond
    	
    	    if (_500us_cca_index == 208)
    	    {
        	    /* It may be on the last timer iteration */
        	
        	    if (*((uint16_t*)(reply_buff+9)) < _500us_cca_values[0])
        	    {
            	    /* This is not possible unless the timer overflow happened on this instant */
            	
            	    *((uint32_t*)(reply_buff+5)) = commonbank.R_TIMESTAMP_SECOND+1; // update second
        	    }
    	    }
	    }
		
		if (clock_was_just_updated_externaly)
		{
			if (TCC1_INTFLAGS & TC1_OVFIF_bm)
			{
				/* Add 1 if the new second interrupt FLAG is already set */
				*((uint32_t*)(reply_buff+5)) = commonbank.R_TIMESTAMP_SECOND+1;	// update second
				*((uint16_t*)(reply_buff+9)) = TCC1_CNT;				        // update microsecond
			}
			else
			{
				*((uint32_t*)(reply_buff+5)) = commonbank.R_TIMESTAMP_SECOND;	// update second
				*((uint16_t*)(reply_buff+9)) = TCC1_CNT;						// update microsecond
				
				if (_500us_cca_index == 208)
				{
					/* It may be on the last timer iteration */
					
					if (*((uint16_t*)(reply_buff+9)) < _500us_cca_values[0])
					{
						/* This is not possible unless the timer overflow happened on this instant */
						
						*((uint32_t*)(reply_buff+5)) = commonbank.R_TIMESTAMP_SECOND+1; // update second
					}
				}
			}
		}
        
        if (add == ADD_R_TIMESTAMP_SECOND)
        {
            if (header == EVENT)
            {
                *((uint16_t*)(reply_buff+9)) = 0;                           // Second's Event always have the us equal to 0
            }
        }            
	}
	else
	{
		*((uint32_t*)(reply_buff+5)) = user_R_TIMESTAMP_SECOND;				// update second
		*((uint16_t*)(reply_buff+9)) = user_TCC1_CNT;						// update microsecond
	}

	/* Check if packet is above limits */
	if ( (reply_buff[1] + 2) > (MAX_PACKET_SIZE - 1) )
		return;

	/* Read the register */
	uint8_t len = (type & MSK_TYPE_LEN) * n_elements;
	uint8_t index = 0;
	
	do
	{
		*(reply_buff+11+index) = *(reg_p+index);
		index++;
	} while(--len != 0);

	/* Calculate checksum */
	len = reply_buff[1] + 2;
	uint8_t checksum;
	check_checksum(reply_buff, len-1, checksum);
	reply_buff[len-1] = checksum;													// update checksum


	/* Send Event */
	if (com_mode == COM_MODE_UART)
	{
		/* Disable TX interrupts before update tx buffers */
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm;
			
		/* Disable USART TX */
		uint8_t TxInterruptState = HWBP_UART_UART.CTRLA & USART_DREINTLVL_gm;
		HWBP_UART_UART.CTRLA &= ~(USART_DREINTLVL_gm);

		/* Xmit trough USART */
		hwbp_uart_xmit(reply_buff, reply_buff[1] + 2);
		
		/* Re-enable USART TX */
		HWBP_UART_UART.CTRLA |= TxInterruptState;

		/* Re-enable high level interrupts */
		PMIC_CTRL = PMIC_RREN_bm | PMIC_LOLVLEN_bm | PMIC_MEDLVLEN_bm | PMIC_HILVLEN_bm;

