harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
	}
	else
	{

	}
}

void core_func_send_event(uint8_t add, bool use_core_timestamp)
{
	if ((commonbank.R_OPERATION_CTRL & MSK_OP_MODE) == GM_OP_MODE_ACTIVE)
		xmit(add, EVENT, use_core_timestamp);
}

/************************************************************************/
/* Read common bank                                                     */
/************************************************************************/
bool hwbp_read_common_reg(uint8_t add, uint8_t type)
{
	/* Check if it will not access forbidden memory */
	if (add > COMMON_BANK_ADD_MAX)
		return false;
	
	/* Check if type matches */
	if (regs_type[add] != type)
		return false;

	/* Check if there is something to do before reading */
	/*
	switch (add)
	{
		case ADD_R_TIMESTAMP_SECOND:
			break;
			
		case ADD_R_TIMESTAMP_MICRO:
			* Update R_TIMESTAMP_MICRO *
			commonbank.R_TIMESTAMP_MICRO = TCC1_CNT;
			break;
	}
	*/
	
	/* Update R_TIMESTAMP_MICRO */
	if (add == ADD_R_TIMESTAMP_MICRO)
		commonbank.R_TIMESTAMP_MICRO = TCC1_CNT;
	
	/* Update R_CONFIG */
	else if (add == ADD_R_TIMESTAMP_MICRO)
		hwbp_read_common_reg_CONFIG();
	
	/* Update R_HEARTEAT */
	else if (add == ADD_R_HEARTBEAT)
		{
			if (commonbank.R_CLOCK_CONFIG & B_CLK_GEN)
				commonbank.R_HEARTBEAT |= B_IS_SYNCHRONIZED;
		}

	/* Return success */
	return true;
}

/************************************************************************/
/* Write to common bank                                                 */
/************************************************************************/
bool hwbp_write_common_reg(uint8_t add, uint8_t type, uint8_t * content, uint16_t n_elements)
{
	/* Check if it will not access forbidden memory */
	if (add > COMMON_BANK_ADD_MAX)
		return false;
		
	/* Check if type matches */
	if (regs_type[add] != type)
		return false;

	/* Check if the number of elements matches */
	if (regs_n_elements[add] != n_elements)
		return false;
	
	/* R_TIMESTAMP_SECOND */
	if (add == ADD_R_TIMESTAMP_SECOND)
	{
		/* Return false is register is locked */
		if (commonbank.R_CLOCK_CONFIG & B_CLK_LOCK)
			return false;
		
		/* Update register */
		commonbank.R_TIMESTAMP_SECOND = *((uint32_t*)(content));
		
		/* Update offset */
		if (commonbank.R_TIMESTAMP_OFFSET != 0)
		{
			TCC1_CNT = 0;
			TCC1_CCA = _500us_cca_values[0] - 1;
			_500us_cca_index = 1;					
			
			for (uint8_t i = 0; i < commonbank.R_TIMESTAMP_OFFSET; i++)
			{
				uint8_t temp_cca = TCC1_CCA;
				TCC1_CCA += _500us_cca_values[_500us_cca_index++ & 0x07];				
				TCC1_CNT = temp_cca + 1;	// Offset by 32 us because there was already a register processing time
			}
		}

		/* Return success */
		return true;
	}

	/* R_OPERATION_CTRL */
	else if (add == ADD_R_OPERATION_CTRL)
	{		
		uint8_t reg = *((uint8_t*)content);
		
		/* Disable of the OP LED? */
		if (!(reg & B_OPLEDEN))
		{
			CLR_STATE_LED;
		}
		
		/* Save previous configuration in a local variable */
		uint8_t temp_R_OPERATION_CTRL = commonbank.R_OPERATION_CTRL;
		
		/* Update register */
		commonbank.R_OPERATION_CTRL = reg & (B_ALIVE_EN | B_OPLEDEN | B_VISUALEN | B_MUTE_RPL | MSK_OP_MODE);
		
		/* Verify if a transition occurs on the B_VISUALEN */
		if ((reg & B_VISUALEN) && !(temp_R_OPERATION_CTRL & B_VISUALEN))
		core_callback_visualen_to_on();
		if (!(reg & B_VISUALEN) && (temp_R_OPERATION_CTRL & B_VISUALEN))
		core_callback_visualen_to_off();

		if (reg & B_DUMP)
		{
			/* Enable the dispatch of the app registers */
			sending_registers = true;
			sending_register_add = 0;
			sending_com_registers = true;
			sending_com_register_add = 0;

			/* Clear DUMP bit */
			commonbank.R_OPERATION_CTRL &= (~B_DUMP);
		}

		/* Check if the Mode changed */
		if (((reg & MSK_OP_MODE) == GM_OP_MODE_STANDBY) && ((temp_R_OPERATION_CTRL & MSK_OP_MODE) != GM_OP_MODE_STANDBY))
		{
			sending_registers = false;

			core_callback_device_to_standby();
			commonbank.R_HEARTBEAT &= ~B_IS_ACTIVE;
		}
		if (((reg & MSK_OP_MODE) == GM_OP_MODE_ACTIVE) && ((temp_R_OPERATION_CTRL & MSK_OP_MODE) != GM_OP_MODE_ACTIVE))
		{
			core_callback_device_to_active();
			commonbank.R_HEARTBEAT |= B_IS_ACTIVE;
		}
		if (((reg & MSK_OP_MODE) == GM_OP_MODE_SPEED) && ((temp_R_OPERATION_CTRL & MSK_OP_MODE) != GM_OP_MODE_SPEED))
		{
			core_callback_device_to_speed();
			commonbank.R_HEARTBEAT &= ~B_IS_ACTIVE;
		}
		
		/* Return success */
		return true;
	}	

	/* ADD_R_RESET_APP */
	else if (add == ADD_R_RESET_DEV)
	{
		return hwbp_write_common_reg_RESET_APP(content);
	}
	
    
    /* ADD_R_DEVICE_NAME */
    else if (add == ADD_R_DEVICE_NAME)
    {        
        write_device_name_to_eeprom(content);
        
        shutdown_counter = 3;
        
        /* Return success */
        return true;
    }
	
	/* ADD_R_DEVICE_NAME */
	else if (add == ADD_R_SERIAL_NUMBER)
	{
		if (*((uint16_t*)(content)) == 0xFFFF)
		{
			enables_serial_number_update = true;
		}
		else
		{
			if (enables_serial_number_update)
			{
				//uint16_t serial_number = *((uint16_t*)(content));
				eeprom_wr_byte(EEPROM_ADD_SN_LOW,  *(content+0));
				eeprom_wr_byte(EEPROM_ADD_SN_HIGH, *(content+1));
				
				shutdown_counter = 3;				
			}
			else
			{
				/* Not possible to write a serial number if not enabled before */
				return false;
			}
		}
		
		/* Return success */
		return true;
	}
	
	/* R_CONFIG */
	else if (add == ADD_R_CONFIG)
	{
		return hwbp_write_common_reg_CONFIG(content);
	}
	/* R_TIMESTAMP_OFFSET */
	if (add == ADD_R_TIMESTAMP_OFFSET)
	{
		commonbank.R_TIMESTAMP_OFFSET = *((uint8_t*)content);
		
		return true;
	}

	/* Return error */
	return false;
}


/************************************************************************/
/* Register RESET_APP                                                   */
/************************************************************************/
bool core_save_all_registers_to_eeprom(void) {
	uint8_t reg = B_SAVE;
	return hwbp_write_common_reg_RESET_APP(&reg);
}

bool hwbp_write_common_reg_RESET_APP(void *a)
{
	uint8_t reg = *((uint8_t*)a);
	
	/* Perform a reset to default values*/
	if (reg == B_RST_DEF)
	{
		write_device_name_to_eeprom(default_device_name);
		
		eeprom_wr_byte(EEPROM_ADD_MEM_IN_USE, EEPROM_RST_USE_REGS_DEF);
		
		shutdown_counter = 3;
	}

	/* Perform a reset to EEPROM values*/
	if (reg == B_RST_EE)
	{
		/* Only if the device is booting from EEPROM */
		if (eeprom_rd_byte(EEPROM_ADD_MEM_IN_USE) == EEPROM_RST_USE_REGS_EE)
		shutdown_counter = 3;
		else
		return false;
	}
	
