harp-tech/core.atxmega/Firmware/Library/hwbp_core.c
	/* Save register and reset device */
	if (reg == B_SAVE)
	{
		eeprom_wr_byte(EEPROM_ADD_MEM_IN_USE, EEPROM_RST_USE_REGS_EE);
		eeprom_wr_byte(EEPROM_ADD_R_OPERATION_CTRL, commonbank.R_OPERATION_CTRL);
		eeprom_wr_byte(EEPROM_ADD_CLOCK_CONFIG, commonbank.R_CLOCK_CONFIG);

		for (uint16_t i = 0; i < core_app_mem_size_to_save; i++)
		eeprom_wr_byte(EEPROM_ADD_APP_REG + i, *(core_pointer_to_app_regs + i));

		shutdown_counter = 3;
	}
	
	/* Update device's name to default */
	if (reg == B_NAME_TO_DEFAULT)
	{
		eeprom_wr_byte(EEPROM_ADD_R_DEVICE_NAME, 0xFF);

		shutdown_counter = 3;
	}

	/* Return success */
	return true;
}

/************************************************************************/
/* Register CONFIG                                                      */
/************************************************************************/
bool core_bool_device_is_repeater(void) {
	return (commonbank.R_CLOCK_CONFIG & B_CLK_REP) ? true : false;
}

bool core_bool_device_is_generator(void) {
	return (commonbank.R_CLOCK_CONFIG & B_CLK_GEN) ? true : false;
}

bool core_bool_clock_is_locked(void) {
	return (commonbank.R_CLOCK_CONFIG & B_CLK_LOCK) ? true : false;
}

bool core_device_to_clock_repeater(void) {
	uint8_t reg = B_CLK_REP;
	return hwbp_write_common_reg_CONFIG(&reg);
}

bool core_device_to_clock_generator(void) {
	uint8_t reg = B_CLK_GEN;
	return hwbp_write_common_reg_CONFIG(&reg);
}

bool core_clock_to_lock(void) {
	uint8_t reg = B_CLK_LOCK;
	return hwbp_write_common_reg_CONFIG(&reg);
}

bool core_clock_to_unlock(void) {
	uint8_t reg = B_CLK_UNLOCK;
	return hwbp_write_common_reg_CONFIG(&reg);
}

void hwbp_read_common_reg_CONFIG(void) {}

bool hwbp_write_common_reg_CONFIG(void *a)
{
	uint8_t reg = *((uint8_t*)a);
	
	/* Return false if the device is not able to repeat the timestamp clock */
	if (reg & B_CLK_REP)
		if ((commonbank.R_CLOCK_CONFIG & B_REP_ABLE) == false)
			return false;

	/* Return false if the device is not able to generate the timestamp clock */
	if (reg & B_CLK_GEN)
		if ((commonbank.R_CLOCK_CONFIG & B_GEN_ABLE) == false)
		return false;

	/* Return false if trying to lock a device acting as a repeater */
	if (reg & B_CLK_LOCK)
		if ((commonbank.R_CLOCK_CONFIG & B_CLK_REP) == true)
			return false;

	/* Configure device to repeater if the device wasn't a repeater */
	if ((reg & B_CLK_REP) && ((commonbank.R_CLOCK_CONFIG & B_CLK_REP) == false))
	{
		commonbank.R_CLOCK_CONFIG &= ~B_CLK_GEN;			// Clear CLK_GEN bit
		commonbank.R_CLOCK_CONFIG |=  B_CLK_REP;			// Set CLK_REP bit
		core_callback_clock_to_repeater();
		commonbank.R_HEARTBEAT &= ~B_IS_SYNCHRONIZED;
	
		/* Removes the timestamp lock if the device is locked */
		if (commonbank.R_CLOCK_CONFIG & B_CLK_LOCK)
		{
			commonbank.R_CLOCK_CONFIG &= ~B_CLK_LOCK;		// Clear LOCK bit because the device is a repeater
			commonbank.R_CLOCK_CONFIG |=  B_CLK_UNLOCK;		// Set UNLOCK bit
			core_callback_clock_to_unlock();
		}
	}

	/* Configure device to generator if the device wasn't a generator */
	if ((reg & B_CLK_GEN) && ((commonbank.R_CLOCK_CONFIG & B_CLK_GEN) == false))
	{
		commonbank.R_CLOCK_CONFIG |=  B_CLK_GEN;			// Set CLK_GEN bit
		commonbank.R_CLOCK_CONFIG &= ~B_CLK_REP;			// Clear CLK_REP bit
		core_callback_clock_to_generator();
		commonbank.R_HEARTBEAT |=  B_IS_SYNCHRONIZED;
	}

	/* Unlock timestamp if was locked */
	if ((reg & B_CLK_UNLOCK) && ((commonbank.R_CLOCK_CONFIG & B_CLK_UNLOCK) == false))
	{
		commonbank.R_CLOCK_CONFIG &= ~B_CLK_LOCK;			// Clear LOCK bit
		commonbank.R_CLOCK_CONFIG |=  B_CLK_UNLOCK;			// Set UNLOCK bit
		core_callback_clock_to_unlock();
	}

	/* Lock timestamp if was unlocked */
	if ((reg & B_CLK_LOCK) && ((commonbank.R_CLOCK_CONFIG & B_CLK_LOCK) == false))
	{
		commonbank.R_CLOCK_CONFIG |=  B_CLK_LOCK;			// Set LOCK bit
		commonbank.R_CLOCK_CONFIG &= ~B_CLK_UNLOCK;			// Clear UNLOCK bit
		core_callback_clock_to_lock();
	}
	
	/* Return success */
	return true;
}


/************************************************************************/
/*  Read R_TIMESTAMP_SECOND and R_TIMESTAMP_MICRO                       */
/************************************************************************/
uint32_t core_func_read_R_TIMESTAMP_SECOND(void)
{	
	return commonbank.R_TIMESTAMP_SECOND;
}

uint16_t core_func_read_R_TIMESTAMP_MICRO(void)
{
	return TCC1_CNT;
}


/************************************************************************/
/* Change from Speed Mode to Standby Mode                               */
/************************************************************************/
void core_func_leave_speed_mode_and_go_to_standby_mode(void)
{
	if ((commonbank.R_OPERATION_CTRL & MSK_OP_MODE) == GM_OP_MODE_SPEED)
	{
		commonbank.R_OPERATION_CTRL = (commonbank.R_OPERATION_CTRL & (~MSK_OP_MODE)) | GM_OP_MODE_STANDBY;
		core_callback_device_to_standby();
		commonbank.R_HEARTBEAT &= ~B_IS_ACTIVE;
	}
}


/************************************************************************/
/* Boolean functions                                                    */
/************************************************************************/
bool core_bool_is_visual_enabled(void)
{
	return (commonbank.R_OPERATION_CTRL & B_VISUALEN) ? true : false;
}

bool core_bool_speed_mode_is_in_use(void)
{
	return ((commonbank.R_OPERATION_CTRL & MSK_OP_MODE) == GM_OP_MODE_SPEED) ? true : false;
}

bool core_bool_device_is_active(void)
{
	return (commonbank.R_HEARTBEAT & B_IS_ACTIVE) ? true : false;
}

bool core_bool_device_is_synchronized(void)
{
	return (commonbank.R_HEARTBEAT & B_IS_SYNCHRONIZED) ? true : false;
}
